package kkkkkk;

public abstract class vovoov
{
  public static int b04490449щщщ04490449щщ = 0;
  public static int b0449щ0449щщ04490449щщ = 2;
  public static int bщ0449щщщ04490449щщ = 14;
  public static int bщщ0449щщ04490449щщ = 1;
  
  public vovoov() {}
  
  public static int b04280428Ш04280428Ш04280428ШШ()
  {
    return 67;
  }
  
  public abstract void b04450445х04450445хх044504450445();
  
  public xdxxdx bх0445х04450445хх044504450445()
  {
    vovoov.1 local1 = new vovoov.1(this);
    int i = bщ0449щщщ04490449щщ;
    int j = bщщ0449щщ04490449щщ;
    if ((bщ0449щщщ04490449щщ + bщщ0449щщ04490449щщ) * bщ0449щщщ04490449щщ % b0449щ0449щщ04490449щщ != b04490449щщщ04490449щщ)
    {
      bщ0449щщщ04490449щщ = 2;
      b04490449щщщ04490449щщ = 86;
    }
    if ((i + j) * bщ0449щщщ04490449щщ % b0449щ0449щщ04490449щщ != b04490449щщщ04490449щщ)
    {
      bщ0449щщщ04490449щщ = 74;
      b04490449щщщ04490449щщ = b04280428Ш04280428Ш04280428ШШ();
    }
    return local1;
  }
}
