/*
 * Decompiled with CFR 0_115.
 * 
 * Could not load the following classes:
 *  android.os.Build
 *  android.os.Build$VERSION
 *  android.text.TextUtils
 *  com.db.pwcc.dbmobile.model.error.DbErrorsPayload
 *  uuuuuu.ooolol
 */
package uuuuuu;

import android.os.Build;
import android.text.TextUtils;
import com.db.pwcc.dbmobile.model.error.DbErrorsPayload;
import com.google.gson.Gson;
import java.lang.reflect.InvocationTargetException;
import java.lang.reflect.Method;
import java.util.HashMap;
import java.util.Map;
import java.util.UUID;
import java.util.concurrent.TimeUnit;
import uuuuuu.ggyygy;
import uuuuuu.hyyhhh;
import uuuuuu.loolol;
import uuuuuu.ooolol;
import uuuuuu.ppphhp;
import uuuuuu.rvvvrv;
import uuuuuu.ygyygy;
import xxxxxx.uxxxxx;

public class ololol<R> {
    private static final String b0071007100710071q00710071q0071 = "\"u\u00140)*26'm\u000b$7";
    private static final String b007100710071qq00710071q0071 = "1\u0005\u0018FE\u0001)7CC8=;";
    private static final int b00710071q0071q00710071q0071 = 0;
    private static final String b00710071qq007100710071q0071 = "yOu\n\u0017\u001c\r\u001c\u001eWtp";
    public static int b00710071qqqqq00710071 = 0;
    private static final int b0071q00710071q00710071q0071 = 0;
    private static final String b0071qq0071q00710071q0071 = "@mmtfpw1Ywm";
    private static final String b0071qqq007100710071q0071 = "}Sv{V\u0001\u0011\u001f!\u0018\u001f\u001f";
    public static int b0071qqqqqq00710071 = 1;
    public static final String bq007100710071q00710071q0071 = "9U\u001b;[YO\u00165HZHL";
    private static final String bq0071q0071q00710071q0071 = "?\u0015,Y]^RZPdZaa!>:";
    private static final String bq0071qq007100710071q0071 = "\u001c\u000e\u0014\f\u0007\u0018\tP\u0018\u0006\u0012\b\u0004\u0006~{\u000e\u0002\u0007\u0005";
    public static int bq0071qqqqq00710071 = 2;
    private static final String bqq00710071q00710071q0071 = "\u000e\f|bl";
    private static final String bqqq0071q00710071q0071 = "\u001aOODLPHZBVLSS";
    private static final String bqqqq007100710071q0071;
    public static int bqqqqqqq00710071 = 39;
    private hyyhhh b0071007100710071007100710071q0071;
    private int b007100710071q007100710071q0071 = 0;
    private Map<String, String> b00710071q0071007100710071q0071 = new HashMap<String, String>();
    private int b0071q00710071007100710071q0071;
    private int b0071q0071q007100710071q0071 = b0071q00710071q00710071q0071;
    private Map<String, String> b0071qq0071007100710071q0071 = new HashMap<String, String>();
    private String bq007100710071007100710071q0071;
    private loolol<R> bq00710071q007100710071q0071;
    private Object bq0071q0071007100710071q0071;
    private boolean bqq00710071007100710071q0071;
    private Gson bqq0071q007100710071q0071;
    private int bqqq0071007100710071q0071;

    public static {
        Object object;
        Object object2;
        Object object3;
        Object object4;
        Object object5;
        Object object6;
        Object object7;
        Object object8;
        Object object9;
        Object object10;
        String string2 = b007100710071qq00710071q0071;
        String string3 = uxxxxx.bb00620062bb0062b0062b0062("AUTSR\n\t\u000f\u000e\u0006\u0005\u000b\nI\u0001\u0006\u0005|{\u0002\u0001@", '\u000b', '\u0005');
        Class[] arrclass = new Class[]{String.class, Character.TYPE, Character.TYPE};
        Method method = ppphhp.class.getMethod(string3, arrclass);
        Object[] arrobject = new Object[]{string2, Character.valueOf('\u008c'), Character.valueOf('\u0005')};
        try {
            object10 = method.invoke(null, arrobject);
        }
        catch (InvocationTargetException var5_70) {
            throw var5_70.getCause();
        }
        b007100710071qq00710071q0071 = (String)object10;
        String string4 = bqqq0071q00710071q0071;
        String string5 = uxxxxx.bb00620062bb0062b0062b0062("\u0018,+*)`_ed\\[a` WV\\[SRXW\u0017", '%', '\u0004');
        Class[] arrclass2 = new Class[]{String.class, Character.TYPE, Character.TYPE};
        Method method2 = ppphhp.class.getMethod(string5, arrclass2);
        Object[] arrobject2 = new Object[]{string4, Character.valueOf(','), Character.valueOf('\u0001')};
        try {
            object7 = method2.invoke(null, arrobject2);
        }
        catch (InvocationTargetException var12_66) {
            throw var12_66.getCause();
        }
        bqqq0071q00710071q0071 = (String)object7;
        String string6 = b0071qq0071q00710071q0071;
        String string7 = uxxxxx.bb00620062bb0062b0062b0062("\n !\"#\\]ef`aij,efnoijrs5", '\'', '\u0002');
        Class[] arrclass3 = new Class[]{String.class, Character.TYPE, Character.TYPE};
        Method method3 = ppphhp.class.getMethod(string7, arrclass3);
        Object[] arrobject3 = new Object[]{string6, Character.valueOf('>'), Character.valueOf('\u0001')};
        try {
            object6 = method3.invoke(null, arrobject3);
        }
        catch (InvocationTargetException var19_65) {
            throw var19_65.getCause();
        }
        b0071qq0071q00710071q0071 = (String)object6;
        String string8 = bq0071q0071q00710071q0071;
        String string9 = uxxxxx.bb00620062bb0062b0062b0062("DXWVU\r\f\u0012\u0011\t\b\u000e\rL\u0004\u0003\t\b~\u0005\u0004C", '\u009d', '\u0003');
        Class[] arrclass4 = new Class[]{String.class, Character.TYPE, Character.TYPE};
        Method method4 = ppphhp.class.getMethod(string9, arrclass4);
        Object[] arrobject4 = new Object[]{string8, Character.valueOf('\u00b2'), Character.valueOf('\u0001')};
        try {
            object = method4.invoke(null, arrobject4);
        }
        catch (InvocationTargetException var26_68) {
            throw var26_68.getCause();
        }
        bq0071q0071q00710071q0071 = (String)object;
        String string10 = bqq00710071q00710071q0071;
        String string11 = uxxxxx.bbbb0062b0062b0062b0062("ey1065ts+*0/'&,+j\"!'&\u001e\u001d#\"a", 'm', 'p', '\u0001');
        Class[] arrclass5 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method5 = ppphhp.class.getMethod(string11, arrclass5);
        Object[] arrobject5 = new Object[]{string10, Character.valueOf('\u00d3'), Character.valueOf('r'), Character.valueOf('\u0000')};
        try {
            object9 = method5.invoke(null, arrobject5);
        }
        catch (InvocationTargetException var33_63) {
            throw var33_63.getCause();
        }
        bqq00710071q00710071q0071 = (String)object9;
        String string12 = bq007100710071q00710071q0071;
        String string13 = uxxxxx.bb00620062bb0062b0062b0062("Vj\"!'&ed\u001c\u001b! \u0018\u0017\u001d\u001c[\u0013\u0012\u0018\u0017\u000f\u000e\u0014\u0013R", '\f', '\u0003');
        Class[] arrclass6 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method6 = ppphhp.class.getMethod(string13, arrclass6);
        Object[] arrobject6 = new Object[]{string12, Character.valueOf('\u00e7'), Character.valueOf('\u00a6'), Character.valueOf('\u0000')};
        try {
            object2 = method6.invoke(null, arrobject6);
        }
        catch (InvocationTargetException var40_67) {
            throw var40_67.getCause();
        }
        bq007100710071q00710071q0071 = (String)object2;
        String string14 = b0071007100710071q00710071q0071;
        String string15 = uxxxxx.bb00620062bb0062b0062b0062(".D}~\u0007\bIJ\u0004\u0005\r\u000e\b\t\u0011\u0012S\r\u000e\u0016\u0017\u0011\u0012\u001a\u001b\\", '\u0098', '\u0000');
        Class[] arrclass7 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method7 = ppphhp.class.getMethod(string15, arrclass7);
        Object[] arrobject7 = new Object[]{string14, Character.valueOf('\u00f9'), Character.valueOf('\u00c3'), Character.valueOf('\u0001')};
        try {
            object4 = method7.invoke(null, arrobject7);
        }
        catch (InvocationTargetException var47_62) {
            throw var47_62.getCause();
        }
        b0071007100710071q00710071q0071 = (String)object4;
        String string16 = b0071qqq007100710071q0071;
        String string17 = uxxxxx.bb00620062bb0062b0062b0062("\u0013'^]cb\"!XW]\\TSYX\u0018ONTSKJPO\u000f", '\u00e6', '\u0004');
        Class[] arrclass8 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method8 = ppphhp.class.getMethod(string17, arrclass8);
        Object[] arrobject8 = new Object[]{string16, Character.valueOf('\u00c0'), Character.valueOf('\u00e2'), Character.valueOf('\u0003')};
        try {
            object5 = method8.invoke(null, arrobject8);
        }
        catch (InvocationTargetException var54_64) {
            throw var54_64.getCause();
        }
        b0071qqq007100710071q0071 = (String)object5;
        String string18 = bq0071qq007100710071q0071;
        String string19 = uxxxxx.bb00620062bb0062b0062b0062("t\t@?ED\u0004\u0003:9?>65;:y1065-,21p", 'y', '\u0005');
        Class[] arrclass9 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method9 = ppphhp.class.getMethod(string19, arrclass9);
        Object[] arrobject9 = new Object[]{string18, Character.valueOf('\u0088'), Character.valueOf('2'), Character.valueOf('\u0001')};
        try {
            object8 = method9.invoke(null, arrobject9);
        }
        catch (InvocationTargetException var61_71) {
            throw var61_71.getCause();
        }
        bq0071qq007100710071q0071 = (String)object8;
        String string20 = b00710071qq007100710071q0071;
        String string21 = uxxxxx.bb00620062bb0062b0062b0062("v\u000b\n\t\b?>DC;:@?~65;:2176u", 'k', '\u0003');
        Class[] arrclass10 = new Class[]{String.class, Character.TYPE, Character.TYPE};
        Method method10 = ppphhp.class.getMethod(string21, arrclass10);
        Object[] arrobject10 = new Object[]{string20, Character.valueOf('\u000b'), Character.valueOf('\u0000')};
        try {
            object3 = method10.invoke(null, arrobject10);
        }
        catch (InvocationTargetException var68_69) {
            throw var68_69.getCause();
        }
        b00710071qq007100710071q0071 = (String)object3;
        bqqqq007100710071q0071 = ololol.class.getSimpleName();
        long l2 = TimeUnit.SECONDS.toMillis(60);
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b0071qqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 == b00710071qqqqq00710071) break;
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = 56;
            }
            case 0: 
        }
        b0071q00710071q00710071q0071 = (int)l2;
    }

    public ololol(int n2, String string2) {
        this(n2, string2, string2.new 1());
    }

    public ololol(int n2, String string2, loolol<R> loolol2) {
        this.bqqq0071007100710071q0071 = n2;
        this.bq007100710071007100710071q0071 = string2;
        this.bq00710071q007100710071q0071 = loolol2;
        this.bqq0071q007100710071q0071 = new Gson();
        this.bqq00710071007100710071q0071 = false;
        this.bp00700070007000700070pp00700070(b0071q00710071q00710071q0071, 0);
    }

    public static int b00700070p0070p0070pp00700070() {
        return 12;
    }

    public static int b0070pp0070p0070pp00700070() {
        return 2;
    }

    public static /* synthetic */ String bp00700070pp0070pp00700070() {
        String string2 = bqqqq007100710071q0071;
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = 29;
        }
        return string2;
    }

    public static int bp0070p0070p0070pp00700070() {
        return 0;
    }

    public static int bpp00700070p0070pp00700070() {
        return 1;
    }

    public void b007000700070007000700070pp00700070(hyyhhh hyyhhh2) {
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            case 0: 
        }
        this.b0071007100710071007100710071q0071 = hyyhhh2;
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = 96;
        }
    }

    public loolol<R> b0070007000700070p0070pp00700070() {
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % ololol.b0070pp0070p0070pp00700070() != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = 50;
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        return this.bq00710071q007100710071q0071;
    }

    public String b007000700070p00700070pp00700070() {
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            bqqqqqqq00710071 = 84;
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        return this.bq007100710071007100710071q0071;
    }

    public void b007000700070pp0070pp00700070(String string2, String string3) {
        block8 : {
            int n2 = bqqqqqqq00710071;
            switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
                default: {
                    bqqqqqqq00710071 = 48;
                    b00710071qqqqq00710071 = 94;
                }
                case 0: 
            }
            String string4 = uxxxxx.bb00620062bb0062b0062b0062("\u0019/012kltuopxy;tu}~xy\u0002\u0003D", '\u0091', '\u0000');
            Class[] arrclass = new Class[]{String.class, Character.TYPE, Character.TYPE};
            Method method = ppphhp.class.getMethod(string4, arrclass);
            Object[] arrobject = new Object[]{"#PPWISZ\u0014<bZP", Character.valueOf('\u00ee'), Character.valueOf('\u0001')};
            try {
                Object object = method.invoke(null, arrobject);
                if (!string2.equalsIgnoreCase((String)object)) break block8;
            }
            catch (InvocationTargetException var8_15) {
                throw var8_15.getCause();
            }
            String string5 = uxxxxx.bbbb0062b0062b0062b0062("\u0011%$#\"YX^]UTZY\u0019POUTLKQP\u0010", '\u00b5', '\u00e3', '\u0001');
            Class[] arrclass2 = new Class[]{String.class, Character.TYPE, Character.TYPE};
            Method method2 = ppphhp.class.getMethod(string5, arrclass2);
            Object[] arrobject2 = new Object[]{"\u001d9j?2BnD97r7DDK=GN\bPVNDQNHEXK\u0007W_O]^VRX^X\u0012g\\Z\u0016\u001a_^n=kawBoovhryZ\u0001xn24,zs\u0004x\u0001vA", Character.valueOf('\u00a3'), Character.valueOf('\u0001')};
            try {
                Object object = method2.invoke(null, arrobject2);
                throw new IllegalArgumentException((String)object);
            }
            catch (InvocationTargetException var15_14) {
                throw var15_14.getCause();
            }
        }
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = 95;
            b00710071qqqqq00710071 = 41;
        }
        this.b0071qq0071007100710071q0071.put(string2, string3);
    }

    public void b00700070p007000700070pp00700070(boolean bl) {
        this.bqq00710071007100710071q0071 = bl;
        if ((ololol.b00700070p0070p0070pp00700070() + b0071qqqqqq00710071) * ololol.b00700070p0070p0070pp00700070() % ololol.b0070pp0070p0070pp00700070() != b00710071qqqqq00710071) {
            if ((ololol.b00700070p0070p0070pp00700070() + ololol.bpp00700070p0070pp00700070()) * ololol.b00700070p0070p0070pp00700070() % ololol.b0070pp0070p0070pp00700070() != b00710071qqqqq00710071) {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            bqqqqqqq00710071 = 68;
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
    }

    public Map<String, String> b00700070pp00700070pp00700070() {
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = 33;
                if ((bqqqqqqq00710071 + ololol.bpp00700070p0070pp00700070()) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
                    bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                    b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                }
                b00710071qqqqq00710071 = 41;
            }
            case 0: 
        }
        return this.b0071qq0071007100710071q0071;
    }

    public void b0070p0070007000700070pp00700070(Object object) {
        this.bq0071q0071007100710071q0071 = object;
        int n2 = bqqqqqqq00710071;
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        if ((n2 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
    }

    public Gson b0070p00700070p0070pp00700070() {
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            int n2 = bqqqqqqq00710071;
            switch (n2 * (n2 + ololol.bpp00700070p0070pp00700070()) % bq0071qqqqq00710071) {
                default: {
                    bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                    b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                }
                case 0: 
            }
            bqqqqqqq00710071 = 41;
            b00710071qqqqq00710071 = 93;
        }
        return this.bqq0071q007100710071q0071;
    }

    public int b0070p0070p00700070pp00700070() {
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % ololol.b0070pp0070p0070pp00700070()) {
            default: {
                int n3 = ololol.bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                switch (n3 * (n3 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
                    default: {
                        bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                        b00710071qqqqq00710071 = 34;
                    }
                    case 0: 
                }
                b00710071qqqqq00710071 = 17;
            }
            case 0: 
        }
        return this.b0071q00710071007100710071q0071;
    }

    public void b0070pp007000700070pp00700070(Gson gson) {
        this.bqq0071q007100710071q0071 = gson;
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
                    bqqqqqqq00710071 = 82;
                    b00710071qqqqq00710071 = 77;
                }
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            case 0: 
        }
    }

    public int b0070ppp00700070pp00700070() {
        int n2 = this.bqqq0071007100710071q0071;
        int n3 = bqqqqqqq00710071;
        switch (n3 * (n3 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                int n4 = ololol.bqqqqqqq00710071 = 42;
                switch (n4 * (n4 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
                    default: {
                        bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                        b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                    }
                    case 0: 
                }
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            case 0: 
        }
        return n2;
    }

    public final void bp00700070007000700070pp00700070(int n2, int n3) {
        this.b0071q0071q007100710071q0071 = n2;
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != ololol.bp0070p0070p0070pp00700070()) {
            if ((bqqqqqqq00710071 + ololol.bpp00700070p0070pp00700070()) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = 97;
            }
            bqqqqqqq00710071 = 72;
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        this.b007100710071q007100710071q0071 = n3;
    }

    public int bp007000700070p0070pp00700070() {
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = 23;
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            case 0: 
        }
        int n3 = bqqqqqqq00710071;
        switch (n3 * (n3 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = 18;
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            case 0: 
        }
        return this.b0071q0071q007100710071q0071;
    }

    public Object bp00700070p00700070pp00700070() {
        Object object = this.bq0071q0071007100710071q0071;
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            int n2 = ololol.b00700070p0070p0070pp00700070();
            switch (n2 * (n2 + ololol.bpp00700070p0070pp00700070()) % bq0071qqqqq00710071) {
                default: {
                    bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                    b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                }
                case 0: 
            }
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        return object;
    }

    public void bp0070p007000700070pp00700070(Map<String, String> map) {
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = 48;
            }
            case 0: 
        }
        this.b00710071q0071007100710071q0071 = map;
        int n3 = bqqqqqqq00710071;
        switch (n3 * (n3 + b0071qqqqqq00710071) % ololol.b0070pp0070p0070pp00700070()) {
            default: {
                bqqqqqqq00710071 = 66;
                b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            }
            case 0: 
        }
    }

    public String bp0070pp00700070pp00700070() {
        Object object;
        int n2 = (bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071;
        int n3 = bq0071qqqqq00710071;
        if ((ololol.b00700070p0070p0070pp00700070() + b0071qqqqqq00710071) * ololol.b00700070p0070p0070pp00700070() % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        if (n2 % n3 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        String string2 = uxxxxx.bb00620062bb0062b0062b0062("DZ\u0014\u0015\u001d\u001e_`\u001a\u001b#$\u001e\u001f'(i#$,-'(01r", '\u00ef', '\u0001');
        Class[] arrclass = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method = ppphhp.class.getMethod(string2, arrclass);
        Object[] arrobject = new Object[]{"53$\n\u0014", Character.valueOf('\u00c4'), Character.valueOf('\u00a4'), Character.valueOf('\u0001')};
        try {
            object = method.invoke(null, arrobject);
        }
        catch (InvocationTargetException var7_8) {
            throw var7_8.getCause();
        }
        return (String)object;
    }

    public void bpp0070007000700070pp00700070(int n2) {
        int n3 = (bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % ololol.b0070pp0070p0070pp00700070();
        if ((ololol.b00700070p0070p0070pp00700070() + b0071qqqqqq00710071) * ololol.b00700070p0070p0070pp00700070() % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = 83;
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        if (n3 != b00710071qqqqq00710071) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        this.b0071q00710071007100710071q0071 = n2;
    }

    public Map<String, String> bpp0070p00700070pp00700070() {
        if ((bqqqqqqq00710071 + ololol.bpp00700070p0070pp00700070()) * bqqqqqqq00710071 % bq0071qqqqq00710071 != ololol.bp0070p0070p0070pp00700070()) {
            bqqqqqqq00710071 = 6;
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        return this.b00710071q0071007100710071q0071;
    }

    public hyyhhh bppp007000700070pp00700070() {
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != b00710071qqqqq00710071) {
            int n2 = bqqqqqqq00710071;
            switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
                default: {
                    bqqqqqqq00710071 = 73;
                    b00710071qqqqq00710071 = 37;
                }
                case 0: 
            }
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
        }
        return this.b0071007100710071007100710071q0071;
    }

    /*
     * Loose catch block
     * Enabled aggressive block sorting
     * Enabled unnecessary exception pruning
     * Enabled aggressive exception aggregation
     * Lifted jumps to return sites
     */
    public void bppp0070p0070pp00700070(ygyygy ygyygy2, ggyygy ggyygy2) {
        String string2;
        Object object;
        Object object2;
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + ololol.bpp00700070p0070pp00700070()) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = 94;
            }
            case 0: 
        }
        String string3 = ygyygy2.b0070ppp0070ppp0070p();
        if (string3 != null) {
            String string4 = uxxxxx.bbbb0062b0062b0062b0062("2HIJK\u0005\u0006\u000e\u000f\t\n\u0012\u0013T\u000e\u000f\u0017\u0018\u0012\u0013\u001b\u001c]", '\u009f', '\u00ae', '\u0003');
            Class[] arrclass = new Class[]{String.class, Character.TYPE, Character.TYPE};
            Method method = ppphhp.class.getMethod(string4, arrclass);
            Object[] arrobject = new Object[]{"8\u000e.LGJTZM\u00165Pe", Character.valueOf('\u00de'), Character.valueOf('\u0002')};
            Object object3 = method.invoke(null, arrobject);
            this.b007000700070pp0070pp00700070((String)object3, string3);
        }
        String string5 = uxxxxx.bbbb0062b0062b0062b0062(")?@AB{|\u0005\u0006\u0001\t\nK\u0005\u0006\u000e\u000f\t\n\u0012\u0013T", '1', '\u0094', '\u0003');
        Class[] arrclass = new Class[]{String.class, Character.TYPE, Character.TYPE};
        Method method = ppphhp.class.getMethod(string5, arrclass);
        Object[] arrobject = new Object[]{"i?ey\u0007\f|\f\u000eGd`", Character.valueOf('\u0011'), Character.valueOf('\u0002')};
        try {
            Object object4 = method.invoke(null, arrobject);
            this.b007000700070pp0070pp00700070((String)object4, UUID.randomUUID().toString());
            string2 = ggyygy2.bpp0070ppppp0070p();
        }
        catch (InvocationTargetException var9_66) {
            throw var9_66.getCause();
        }
        if (!TextUtils.isEmpty((CharSequence)string2)) {
            String string6 = uxxxxx.bb00620062bb0062b0062b0062("\r! \u001f\u001eUTZYQPVU\u0015LKQPHGML\f", '\u00d4', '\u0003');
            Class[] arrclass2 = new Class[]{String.class, Character.TYPE, Character.TYPE};
            Method method2 = ppphhp.class.getMethod(string6, arrclass2);
            Object[] arrobject2 = new Object[]{"\u000fDD9AE=O7KAHH", Character.valueOf('\u00e5'), Character.valueOf('\u0001')};
            Object object5 = method2.invoke(null, arrobject2);
            String string7 = (String)object5;
            StringBuilder stringBuilder = new StringBuilder();
            String string8 = uxxxxx.bb00620062bb0062b0062b0062("[qrst./7823;<}78@A;<DE\u0007", '\u00f7', '\u0002');
            Class[] arrclass3 = new Class[]{String.class, Character.TYPE, Character.TYPE};
            Method method3 = ppphhp.class.getMethod(string8, arrclass3);
            Object[] arrobject3 = new Object[]{"b\u0005\u0010\u0002\u000e:", Character.valueOf('o'), Character.valueOf('\u0004')};
            Object object6 = method3.invoke(null, arrobject3);
            this.b007000700070pp0070pp00700070(string7, stringBuilder.append((String)object6).append(string2).toString());
        }
        if (ggyygy2.bp00700070ppppp0070p()) {
            String string9 = uxxxxx.bbbb0062b0062b0062b0062("cw/.43rq)(.-%$*)h \u001f%$\u001c\u001b! _", '|', '\u00fc', '\u0001');
            Class[] arrclass4 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
            Method method4 = ppphhp.class.getMethod(string9, arrclass4);
            Object[] arrobject4 = new Object[]{"XLTNK^Q\u001bdTbZX\\WVj`gg", Character.valueOf('\u00bc'), Character.valueOf('\u00d6'), Character.valueOf('\u0002')};
            Object object7 = method4.invoke(null, arrobject4);
            this.b007000700070pp0070pp00700070((String)object7, Boolean.TRUE.toString());
        }
        String string10 = uxxxxx.bb00620062bb0062b0062b0062("^r*)/.ml$#)( \u001f%$c\u001b\u001a \u001f\u0017\u0016\u001c\u001bZ", '\u0081', '\u0004');
        Class[] arrclass5 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method5 = ppphhp.class.getMethod(string10, arrclass5);
        Object[] arrobject5 = new Object[]{"\u001dr\u0016\u001bu 0>@7>>", Character.valueOf('Y'), Character.valueOf('\u0015'), Character.valueOf('\u0002')};
        try {
            Object object8 = method5.invoke(null, arrobject5);
            this.b007000700070pp0070pp00700070((String)object8, Build.VERSION.RELEASE);
        }
        catch (InvocationTargetException var16_63) {
            throw var16_63.getCause();
        }
        String string11 = uxxxxx.bbbb0062b0062b0062b0062("3IJKL\u0006\u0007\u000f\u0010\n\u000b\u0013\u0014U\u000f\u0010\u0018\u0019\u0013\u0014\u001c\u001d^", '\u0086', '\u00c8', '\u0003');
        Class[] arrclass6 = new Class[]{String.class, Character.TYPE, Character.TYPE};
        Method method6 = ppphhp.class.getMethod(string11, arrclass6);
        Object[] arrobject6 = new Object[]{"*\u0015EF\u0004.>LNELL", Character.valueOf('\u00e7'), Character.valueOf('\u0001')};
        try {
            object = method6.invoke(null, arrobject6);
        }
        catch (InvocationTargetException var22_64) {
            throw var22_64.getCause();
        }
        String string12 = (String)object;
        String string13 = uxxxxx.bb00620062bb0062b0062b0062(";O\u0007\u0006\f\u000bJI\u0001\u0006\u0005|{\u0002\u0001@wv|{srxw7", '\u00d2', '\u0004');
        Class[] arrclass7 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method7 = ppphhp.class.getMethod(string13, arrclass7);
        Object[] arrobject7 = new Object[]{"64@69", Character.valueOf('\u00b3'), Character.valueOf('\u00cf'), Character.valueOf('\u0003')};
        try {
            Object object9 = method7.invoke(null, arrobject7);
            this.b007000700070pp0070pp00700070(string12, (String)object9);
        }
        catch (InvocationTargetException var29_65) {
            throw var29_65.getCause();
        }
        if (!TextUtils.isEmpty((CharSequence)ggyygy2.b0070p0070ppppp0070p())) {
            String string14 = uxxxxx.bbbb0062b0062b0062b0062("8L\u0004\u0003\t\bGF}|\u0003\u0002yx~}=tsyxpout4", ']', '3', '\u0001');
            Class[] arrclass8 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
            Method method8 = ppphhp.class.getMethod(string14, arrclass8);
            Object[] arrobject8 = new Object[]{"zNc\u000f\u0011\u0010\u0002\b{\u000e\u0002\u0007\u0005B]W", Character.valueOf('\u00b4'), Character.valueOf('W'), Character.valueOf('\u0001')};
            Object object10 = method8.invoke(null, arrobject8);
            this.b007000700070pp0070pp00700070((String)object10, ggyygy2.b0070p0070ppppp0070p());
        }
        String string15 = bqqqq007100710071q0071;
        StringBuilder stringBuilder = new StringBuilder().append(this.b007000700070p00700070pp00700070());
        int n3 = bqqqqqqq00710071;
        switch (n3 * (n3 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = 66;
            }
            case 0: 
        }
        String string16 = uxxxxx.bb00620062bb0062b0062b0062("DX\u0010\u000f\u0015\u0014SR\n\t\u000f\u000e\u0006\u0005\u000b\nI\u0001\u0006\u0005|{\u0002\u0001@", '\n', '\u0005');
        Class[] arrclass9 = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
        Method method9 = ppphhp.class.getMethod(string16, arrclass9);
        Object[] arrobject9 = new Object[]{"z>d[OQ]\nXN\u0007NJEGGSS\u0019}", Character.valueOf('\u001e'), Character.valueOf('p'), Character.valueOf('\u0000')};
        try {
            object2 = method9.invoke(null, arrobject9);
        }
        catch (InvocationTargetException var38_71) {
            throw var38_71.getCause();
        }
        rvvvrv.b007100710071q00710071q0071q0071(string15, stringBuilder.append((String)object2).append(this.b0071qq0071007100710071q0071.size()).toString());
        return;
        catch (InvocationTargetException invocationTargetException) {
            throw invocationTargetException.getCause();
        }
        catch (InvocationTargetException invocationTargetException2) {
            throw invocationTargetException2.getCause();
        }
        catch (InvocationTargetException invocationTargetException3) {
            throw invocationTargetException3.getCause();
        }
        catch (InvocationTargetException invocationTargetException4) {
            throw invocationTargetException4.getCause();
        }
        catch (InvocationTargetException invocationTargetException5) {
            throw invocationTargetException5.getCause();
        }
    }

    public int bpppp00700070pp00700070() {
        int n2 = bqqqqqqq00710071;
        switch (n2 * (n2 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
            default: {
                bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                b00710071qqqqq00710071 = 78;
                int n3 = bqqqqqqq00710071;
                switch (n3 * (n3 + b0071qqqqqq00710071) % bq0071qqqqq00710071) {
                    default: {
                        bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                        b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
                    }
                    case 0: 
                }
            }
            case 0: 
        }
        return this.b007100710071q007100710071q0071;
    }

    public boolean bpppppp0070p00700070() {
        boolean bl = this.bqq00710071007100710071q0071;
        if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != ololol.bp0070p0070p0070pp00700070()) {
            bqqqqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            b00710071qqqqq00710071 = ololol.b00700070p0070p0070pp00700070();
            if ((bqqqqqqq00710071 + b0071qqqqqq00710071) * bqqqqqqq00710071 % bq0071qqqqq00710071 != ololol.bp0070p0070p0070pp00700070()) {
                bqqqqqqq00710071 = 71;
                b00710071qqqqq00710071 = 56;
            }
        }
        return bl;
    }

    public class 1
    extends loolol<R> {
        public static int b007100710071qqqq00710071 = 2;
        public static int b0071q0071qqqq00710071 = 41;
        public static int bq00710071qqqq00710071 = 1;

        public static int b00700070007000700070ppp00700070() {
            return 0;
        }

        public static int bppppp0070pp00700070() {
            return 4;
        }

        @Override
        public void b006100610061aaa006100610061a(DbErrorsPayload dbErrorsPayload) {
            StringBuilder stringBuilder;
            String string2;
            int n2;
            String string3 = ololol.bp00700070pp0070pp00700070();
            StringBuilder stringBuilder2 = new StringBuilder();
            int n3 = 1.bppppp0070pp00700070();
            switch (n3 * (n3 + bq00710071qqqq00710071) % b007100710071qqqq00710071) {
                default: {
                    b0071q0071qqqq00710071 = 1.bppppp0070pp00700070();
                    bq00710071qqqq00710071 = 1.bppppp0070pp00700070();
                }
                case 0: 
            }
            String string4 = uxxxxx.bbbb0062b0062b0062b0062(">T\u000e\u000f\u0017\u0018YZ\u0014\u0015\u001d\u001e\u0018\u0019!\"c\u001d\u001e&'!\"*+l", '\u00af', 'T', '\u0002');
            Class[] arrclass = new Class[]{String.class, Character.TYPE, Character.TYPE, Character.TYPE};
            Method method = ppphhp.class.getMethod(string4, arrclass);
            Object[] arrobject = new Object[]{"\b6759g;/><<<B5p;:BDH<<x@JN\u0017}", Character.valueOf('\u00ce'), Character.valueOf('r'), Character.valueOf('\u0003')};
            try {
                Object object = method.invoke(null, arrobject);
                stringBuilder = stringBuilder2.append((String)object);
                string2 = String.this;
                n2 = b0071q0071qqqq00710071;
            }
            catch (InvocationTargetException var9_13) {
                throw var9_13.getCause();
            }
            switch (n2 * (n2 + bq00710071qqqq00710071) % b007100710071qqqq00710071) {
                default: {
                    b0071q0071qqqq00710071 = 1.bppppp0070pp00700070();
                    bq00710071qqqq00710071 = 1.bppppp0070pp00700070();
                }
                case 0: 
            }
            rvvvrv.bqqqq00710071q0071q0071(string3, stringBuilder.append(string2).toString());
        }

        @Override
        public void baaa0061aa006100610061a(ooolol<R> ooolol2) {
            Object object;
            if ((b0071q0071qqqq00710071 + bq00710071qqqq00710071) * b0071q0071qqqq00710071 % b007100710071qqqq00710071 != 1.b00700070007000700070ppp00700070()) {
                b0071q0071qqqq00710071 = 78;
                bq00710071qqqq00710071 = 1.bppppp0070pp00700070();
                int n2 = b0071q0071qqqq00710071;
                switch (n2 * (n2 + bq00710071qqqq00710071) % b007100710071qqqq00710071) {
                    default: {
                        b0071q0071qqqq00710071 = 1.bppppp0070pp00700070();
                        bq00710071qqqq00710071 = 6;
                    }
                    case 0: 
                }
            }
            String string2 = ololol.bp00700070pp0070pp00700070();
            StringBuilder stringBuilder = new StringBuilder();
            String string3 = uxxxxx.bbbb0062b0062b0062b0062("\n\u001e\u001d\u001c\u001bRQWVNMSR\u0012IHNMEDJI\t", '\u00bc', 'd', '\u0001');
            Class[] arrclass = new Class[]{String.class, Character.TYPE, Character.TYPE};
            Method method = ppphhp.class.getMethod(string3, arrclass);
            Object[] arrobject = new Object[]{"J^mkkkqd jiqswkk(oy}F-", Character.valueOf('\u00fa'), Character.valueOf('\u0001')};
            try {
                object = method.invoke(null, arrobject);
            }
            catch (InvocationTargetException var8_10) {
                throw var8_10.getCause();
            }
            rvvvrv.bqqqq00710071q0071q0071(string2, stringBuilder.append((String)object).append(String.this).toString());
        }
    }

    public static class oollol {
        public static int b00710071q0071qqq00710071 = 0;
        public static int b0071q00710071qqq00710071 = 2;
        public static int bq0071q0071qqq00710071 = 43;
        public static int bqq00710071qqq00710071 = 1;
        private String b0071qq0071qqq00710071;
        private int bqqq0071qqq00710071 = 0;

        public static int b00700070ppp0070pp00700070() {
            return 85;
        }

        public static int b0070pppp0070pp00700070() {
            return 1;
        }

        public static int bp0070ppp0070pp00700070() {
            return 2;
        }

        public oollol b0070p0070pp0070pp00700070(String string2) {
            this.b0071qq0071qqq00710071 = string2;
            if ((bq0071q0071qqq00710071 + oollol.b0070pppp0070pp00700070()) * bq0071q0071qqq00710071 % oollol.bp0070ppp0070pp00700070() != b00710071q0071qqq00710071 && ((oollol.bq0071q0071qqq00710071 = 51) + bqq00710071qqq00710071) * bq0071q0071qqq00710071 % b0071q00710071qqq00710071 != (oollol.b00710071q0071qqq00710071 = 32)) {
                bq0071q0071qqq00710071 = 19;
                b00710071q0071qqq00710071 = 11;
            }
            return this;
        }

        public ololol bpp0070pp0070pp00700070() {
            int n2 = this.bqqq0071qqq00710071;
            if ((bq0071q0071qqq00710071 + bqq00710071qqq00710071) * bq0071q0071qqq00710071 % b0071q00710071qqq00710071 != b00710071q0071qqq00710071) {
                bq0071q0071qqq00710071 = 32;
                b00710071q0071qqq00710071 = oollol.b00700070ppp0070pp00700070();
                int n3 = bq0071q0071qqq00710071;
                switch (n3 * (n3 + oollol.b0070pppp0070pp00700070()) % b0071q00710071qqq00710071) {
                    default: {
                        bq0071q0071qqq00710071 = 65;
                        b00710071q0071qqq00710071 = 50;
                    }
                    case 0: 
                }
            }
            return new ololol(n2, this.b0071qq0071qqq00710071);
        }
    }

}

