package o;

class ˤ
{
  public static final int[] ʻ;
  public static final int[] ʼ;
  static final int[] ʽ;
  static final int[] ˊ = { 16842755, 16843041, 16843093, 16843097, 16843551, 16843754, 16843771, 16843778, 16843779 };
  public static final int[] ˊॱ = { 16843489, 16843781, 16843892, 16843893 };
  static final int[] ˋ;
  static final int[] ˎ;
  static final int[] ˏ = { 16842755, 16843189, 16843190, 16843556, 16843557, 16843558, 16843866, 16843867 };
  static final int[] ॱ;
  public static final int[] ॱˊ = { 16843772, 16843773, 16843774, 16843775, 16843781 };
  public static final int[] ॱॱ;
  public static final int[] ᐝ;
  
  static
  {
    ˋ = new int[] { 16842755, 16843780, 16843781, 16843782, 16843783, 16843784, 16843785, 16843786, 16843787, 16843788, 16843789, 16843979, 16843980, 16844062 };
    ˎ = new int[] { 16842755, 16843781 };
    ॱ = new int[] { 16843161 };
    ʽ = new int[] { 16842755, 16843213 };
    ʼ = new int[] { 16843073, 16843160, 16843198, 16843199, 16843200, 16843486, 16843487, 16843488, 17891484 };
    ॱॱ = new int[] { 16843490 };
    ʻ = new int[] { 16843486, 16843487, 16843488, 16843489 };
    ᐝ = new int[] { 16842788, 16843073, 16843488, 16843992 };
  }
  
  ˤ() {}
}
